tutorials/incompressible/simpleSolver/ras/angledDuctExplicit/0/U
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall
    {
        type            noSlipWall;
    }
    porosityWall
    {
        type            slip;
        value           uniform (0 0 0);
    }
    inlet
    {
        type                   flowRateInletVelocity;
        volumetricFlowRate     constant 0.1;
        value                  uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}

// ************************************************************************* //
